{"config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "bias_constraint": null, "name": "conv2d_1", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "trainable": true, "padding": "valid", "kernel_size": [3, 3], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_constraint": null, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "activation": "relu", "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 10, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}